Table of Contents
 Class MatReinforcementAUS
Namespace
IdeaRS.OpenModel.Material
Assembly
IdeaRS.OpenModel.dll
Material reinforcement AUS
[OpenModelClass("CI.StructModel.Libraries.Material.American.MatReinforcementAUS,CI.Material", "CI.StructModel.Libraries.Material.IMatReinforcement,CI.BasicTypes", typeof(MatReinforcement))]
public class MatReinforcementAUS : MatReinforcement
Inheritance
object
OpenObject
OpenElementId
Material
MatReinforcement
MatReinforcementAUS
Inherited Members
 MatReinforcement.BarSurface
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 MatReinforcementAUS()
Constructor
public MatReinforcementAUS()
Properties
 Epssu
Characteristic strain of reinforcement
public double Epssu { get; set; }
Property Value
double
 Fy
Characteristic yield strength of reinforcement
public double Fy { get; set; }
Property Value
double
 Edit this page